In [3]:
import numpy as np
import pandas as pd

In [4]:
#   school class            name date_Of_Birth   age  height  weight  address                                                       
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4

In [5]:
a=[['S1'  , 's001' ,    'V' , 'Alberto Franco'    , '15/05/2002' ,  12   , 173   ,   35 , 'street1'],
['S2' ,  's002'   ,  'V' ,   'Gino Mcneill'   ,  '17/05/2002'  , 12  ,  192  ,    32 , 'street2'],
['S3'  , 's003'   , 'VI'  ,   'Ryan Parkes'  ,  '16/02/1999'  , 13  ,  186   ,   33 , 'street3'],
['S4'  , 's001'  ,  'VI'  ,  'Eesha Hinton'  ,   '25/09/1998'  , 13  ,  167   ,   30 , 'street1'],
['S5'  ,'s002' ,    'V'   , 'Gino Mcneill'  ,   '11/05/2002'  , 14   , 151   ,   31 , 'street2'],
['S6'  , 's004'  ,  'VI'   , 'David Parkes' ,    '15/09/1997'  , 12  ,  159   ,   32 , 'street4']]

In [6]:
df=pd.DataFrame(a,columns=['','school' ,'class' ,'name', 'date_Of_Birth'  , 'age' , 'height' , 'weight' , 'address'])

In [7]:
df

      school class            name date_Of_Birth  age  height  weight  address
0  S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1
1  S2   s002     V    Gino Mcneill    17/05/2002   12     192      32  street2
2  S3   s003    VI     Ryan Parkes    16/02/1999   13     186      33  street3
3  S4   s001    VI    Eesha Hinton    25/09/1998   13     167      30  street1
4  S5   s002     V    Gino Mcneill    11/05/2002   14     151      31  street2
5  S6   s004    VI    David Parkes    15/09/1997   12     159      32  street4

In [8]:
#q1
grp1=df.groupby(by='school')
grp1

In [9]:
print('Mean-',end='\n')

grp1['age'].mean()

Mean-

school
s001    12.5
s002    13.0
s003    13.0
s004    12.0
Name: age, dtype: float64

In [10]:
print('Min.-',end='\n')
grp1['age'].min()

Min.-

school
s001    12
s002    12
s003    13
s004    12
Name: age, dtype: int64

In [11]:
print('Max-',end='\n')
grp1['age'].max()

Max-

school
s001    13
s002    14
s003    13
s004    12
Name: age, dtype: int64

In [12]:
df

      school class            name date_Of_Birth  age  height  weight  address
0  S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1
1  S2   s002     V    Gino Mcneill    17/05/2002   12     192      32  street2
2  S3   s003    VI     Ryan Parkes    16/02/1999   13     186      33  street3
3  S4   s001    VI    Eesha Hinton    25/09/1998   13     167      30  street1
4  S5   s002     V    Gino Mcneill    11/05/2002   14     151      31  street2
5  S6   s004    VI    David Parkes    15/09/1997   12     159      32  street4

In [13]:
#q2.
df.groupby(by=['school','class']).size()

school  class
s001    V        1
        VI       1
s002    V        2
s003    VI       1
s004    VI       1
dtype: int64

In [15]:
#2.
x=df.groupby(['school','age']).mean()
# y=x.sum().reset_index()
# y.info()
# y[['school','age']]

TypeError: agg function failed [how->mean,dtype->object]

In [16]:
# #Q7.
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5006
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5007
# 11   70013    3045.60  2012-04-25         3002         5001

In [6]:
data = pd.DataFrame({
    'ord_no': [70001, 70009, 70002, 70004, 70007, 70005, 70008, 70010, 70003, 70012, 70011, 70013],
    'purch_amt': [150.50, 270.65, 65.26, 110.50, 948.50, 2400.60, 5760.00, 1983.43, 2480.40, 250.45, 75.29, 3045.60],
    'ord_date': ['2012-10-05', '2012-09-10', '2012-10-05', '2012-08-17', '2012-09-10', '2012-07-27', '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3005, 3001, 3002, 3009, 3005, 3007, 3002, 3004, 3009, 3008, 3003, 3002],
    'salesman_id': [5002, 5005, 5001, 5003, 5002, 5001, 5001, 5006, 5003, 5002, 5007, 5001]
})

In [7]:
data

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [8]:
# 7. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id). 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5006
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5007
# 11   70013    3045.60  2012-04-25         3002         5001
df=data.copy()
df
grp1=df.groupby(by='customer_id')
print(grp1.groups)
# grp1['3002']
df1=grp1.get_group(3002)

print(df1)
print(df1['purch_amt'].mean())
print(df1['purch_amt'].min())
print(df1['purch_amt'].max())

{3001: [1], 3002: [2, 6, 11], 3003: [10], 3004: [7], 3005: [0, 4], 3007: [5], 3008: [9], 3009: [3, 8]}
    ord_no  purch_amt    ord_date  customer_id  salesman_id
2    70002      65.26  2012-10-05         3002         5001
6    70008    5760.00  2012-09-10         3002         5001
11   70013    3045.60  2012-04-25         3002         5001
2956.9533333333334
65.26
5760.0

In [9]:
# 8. Write a Pandas program to split a dataset to group by two columns and count by each row. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5006
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5007
# 11   70013    3045.60  2012-04-25         3002         5001

grp2=df.groupby(['customer_id','salesman_id'])
grp2.groups
grp2.get_group((3002, 5001))
grp2['ord_date'].count()

customer_id  salesman_id
3001         5005           1
3002         5001           3
3003         5007           1
3004         5006           1
3005         5002           2
3007         5001           1
3008         5002           1
3009         5003           2
Name: ord_date, dtype: int64

In [43]:
#disputed

#9. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups. 
# In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5006
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5007
# 11   70013    3045.60  2012-04-25         3002         5001

df_new=df[['customer_id','salesman_id','purch_amt']]

df_new2=df_new.groupby(['customer_id','salesman_id']).sum()
df_new2=df_new2.sort_values(by='purch_amt')
df_new2

                         purch_amt
customer_id salesman_id
3003        5007             75.29
3008        5002            250.45
3001        5005            270.65
3005        5002           1099.00
3004        5006           1983.43
3007        5001           2400.60
3009        5003           2590.90
3002        5001           8870.86

In [82]:
# 10. Write a Pandas program to split the following dataframe into groups based on customer id and create a list of order date for each group. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5006
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5007
# 11   70013    3045.60  2012-04-25         3002         5001

grp=df.groupby('customer_id')
d={}
for x,y in grp:
    
    d[y['customer_id']].extend(y['ord_date'])
    print(y,end='\n\n\n')

print(d)

TypeError: unhashable type: 'Series'

In [55]:
# 11. Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  05-10-2012         3001         5002
# 1    70009     270.65  09-10-2012         3001         5005
# 2    70002      65.26  05-10-2012         3005         5001
# 3    70004     110.50  08-17-2012         3001         5003
# 4    70007     948.50  10-09-2012         3005         5002
# 5    70005    2400.60  07-27-2012         3001         5001
# 6    70008    5760.00  10-09-2012         3005         5001
# 7    70010    1983.43  10-10-2012         3001         5006
# 8    70003    2480.40  10-10-2012         3005         5003
# 9    70012     250.45  06-17-2012         3001         5002
# 10   70011      75.29  07-08-2012         3005         5007
# 11   70013    3045.60  04-25-2012         3005         5001
new_df=df.copy()
new_df['month']=new_df['ord_date'].apply(lambda a:a.split('-')[1])
new_df_monthly=new_df[['month','purch_amt']]
new_df_monthly.groupby(by='month').sum()

       purch_amt
month
04       3045.60
06        250.45
07       2400.60
08        185.79
09       6979.15
10       4679.59

In [78]:
# 12. Write a Pandas program to split the following dataframe into groups, group by month and year based on order date 
# and find the total purchase amount year wise, month wise. 
new_df=df.copy()
new_df['month']=new_df['ord_date'].apply(lambda a:a.split('-')[1])
new_df['year']=new_df['ord_date'].apply(lambda a:a.split('-')[0])
new_df_monthly_yearly=new_df[['year','month','purch_amt']]
print(new_df_monthly_yearly,end='\n\n')
mnth_wise=new_df_monthly_yearly.groupby(by='month').sum()['purch_amt']
print(mnth_wise,end='\n\n')
yr_wise=new_df_monthly_yearly.groupby(by='year').sum()['purch_amt']
print(yr_wise)

    year month  purch_amt
0   2012    10     150.50
1   2012    09     270.65
2   2012    10      65.26
3   2012    08     110.50
4   2012    09     948.50
5   2012    07    2400.60
6   2012    09    5760.00
7   2012    10    1983.43
8   2012    10    2480.40
9   2012    06     250.45
10  2012    08      75.29
11  2012    04    3045.60

month
04    3045.60
06     250.45
07    2400.60
08     185.79
09    6979.15
10    4679.59
Name: purch_amt, dtype: float64

year
2012    17541.18
Name: purch_amt, dtype: float64

In [15]:
# 13. Write a Pandas program to split the following dataframe into groups based on first column and set other column values into a list of values. 
# Test Data:
#    X   Y   Z
# 0  10  10  22
# 1  10  15  20
# 2  10  11  18
# 3  20  20  20
# 4  30  21  13
# 5  30  12  10
# 6  10  14   0

import pandas as pd

data = {
    'X': [10, 10, 10, 20, 30, 30, 10],
    'Y': [10, 15, 11, 20, 21, 12, 14],
    'Z': [22, 20, 18, 20, 13, 10, 0]
}

df = pd.DataFrame(data)

grp=df.groupby('X')
new_df=df.head(0)
for x,y in grp:
    # print(y)
    new_df=pd.concat([new_df,y])


new_df

    X   Y   Z
0  10  10  22
1  10  15  20
2  10  11  18
6  10  14   0
3  20  20  20
4  30  21  13
5  30  12  10

In [28]:
# 14. Write a Pandas program to split the following dataframe into groups based on all columns and calculate Groupby value counts on the dataframe. 
# Test Data:
#   id  type     book
# 0   1    10     Math
# 1   2    15  English
# 2   1    11  Physics
# 3   1    20     Math
# 4   2    21  English
# 5   1    12  Physics
# 6   2    14  English

# Output:
# book     English  Math  Physics id type                      
# 1  10          0     1        0
#    11          0     0        1
#    12          0     0        1
#    20          0     1        0
# 2  14          1     0        0
#    15          1     0        0
#    21          1     0        0

data = {
    'id': [1, 2, 1, 1, 2, 1, 2],
    'type': [10, 15, 11, 20, 21, 12, 14],
    'book': ['Math', 'English', 'Physics', 'Math', 'English', 'Physics', 'English']
}

df = pd.DataFrame(data)

df.pivot_table('book',['id','type'],'book',aggfunc='size').fillna(0)

book     English  Math  Physics
id type
1  10        0.0   1.0      0.0
   11        0.0   0.0      1.0
   12        0.0   0.0      1.0
   20        0.0   1.0      0.0
2  14        1.0   0.0      0.0
   15        1.0   0.0      0.0
   21        1.0   0.0      0.0

In [40]:
# 15. Write a Pandas program to split the following dataframe into groups and count unique values of 'value' column. 
# Test Data:
#   id value
# 0   1     a
# 1   1     a
# 2   2     b
# 3   3  None
# 4   3     a
# 5   4     a
# 6   4  None
# 7   4     b

# Output:
# value
# a 3
# b 2

data = {
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
}

# Create the DataFrame
df = pd.DataFrame(data)
df.groupby('value')
nw_df=df.head(0)
for x,y in df.groupby('value'):
    y=y.drop_duplicates()
    # print(y)
    nw_df=pd.concat([nw_df,y])

nw_df.groupby('value').count()

       id
value
a       3
b       2

In [43]:
# 16. Write a Pandas program to split a given dataframe into groups and list all the keys from the GroupBy object. 
# Test Data:
#   school_code class            name date_Of_Birth   age  height  weight 
# S1        s001     V  Alberto Franco     15/05/2002   12     173      35   
# S2        s002     V    Gino Mcneill     17/05/2002   12     192      32   
# S3        s003    VI     Ryan Parkes     16/02/1999   13     186      33   
# S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30   
# S5        s002     V    Gino Mcneill     11/05/2002   14     151      31   
# S6        s004    VI    David Parkes     15/09/1997   12     159      32 

import pandas as pd

data = {'school_code': ['S1', 'S2', 'S3', 'S4', 'S5', 'S6'],
        'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
        'name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
        'date_Of_Birth': ['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
        'age': [12, 12, 13, 13, 14, 12],
        'height': [173, 192, 186, 167, 151, 159],
        'weight': [35, 32, 33, 30, 31, 31]}

df = pd.DataFrame(data)
df

  school_code class            name date_Of_Birth  age  height  weight
0          S1     V  Alberto Franco    15/05/2002   12     173      35
1          S2     V    Gino Mcneill    17/05/2002   12     192      32
2          S3    VI     Ryan Parkes    16/02/1999   13     186      33
3          S4    VI    Eesha Hinton    25/09/1998   13     167      30
4          S5     V    Gino Mcneill    11/05/2002   14     151      31
5          S6    VI    David Parkes    15/09/1997   12     159      31

In [ ]:
# 17. Write a Pandas program to split a given dataframe into groups and create a new column with count from GroupBy. 
# Test Data:
#  book_name book_type  book_id
# 0     Book1      Math        1
# 1     Book2   Physics        2
# 2     Book3  Computer        3
# 3     Book4   Science        4
# 4     Book1      Math        1
# 5     Book2   Physics        2
# 6     Book3  Computer        3
# 7     Book5   English        5

In [ ]:
#disputed

# 18. Write a Pandas program to split a given dataframe into groups with bin counts. 
# Test Data:
#    ord_no  purch_amt  customer_id  sales_id
# 0    70001     150.50         3005      5002
# 1    70009     270.65         3001      5003
# 2    70002      65.26         3002      5004
# 3    70004     110.50         3009      5003
# 4    70007     948.50         3005      5002
# 5    70005    2400.60         3007      5001
# 6    70008    5760.00         3002      5005
# 7    70010    1983.43         3004      5007
# 8    70003    2480.40         3009      5008
# 9    70012     250.45         3008      5004
# 10   70011      75.29         3003      5005
# 11   70013    3045.60         3002      5001

In [ ]:
# 19. Write a Pandas program to split a given dataframe into groups with multiple aggregations. 
# Split the following given dataframe by school code, class and get mean, min, and max value of height and age for each value of the school.
# Test Data:
#   school class            name date_Of_Birth   age  height   weight  address
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4


# 20. Write a Pandas program to split a given dataframe into groups and display target column as a list of unique values. 
# Test Data:
#   id  type     book
# 0   A     1     Math
# 1   A     1     Math
# 2   A     1  English
# 3   A     1  Physics
# 4   A     2     Math
# 5   A     2  English
# 6   B     1  Physics
# 7   B     1  English
# 8   B     1  Physics
# 9   B     2  English
# 10  B     2  English

# Output:
# List all unique values in a group:
#   id  type                  book
# 0  A     1  Math,English,Physics
# 1  A     2          Math,English
# 2  B     1       Physics,English
# 3  B     2               English


# 21. Write a Pandas program to split the following dataframe into groups and calculate quarterly purchase amount. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  05-10-2012         3001         5002
# 1    70009     270.65  09-10-2012         3001         5005
# 2    70002      65.26  05-10-2012         3005         5001
# 3    70004     110.50  08-17-2012         3001         5003
# 4    70007     948.50  10-09-2012         3005         5002
# 5    70005    2400.60  07-27-2012         3001         5001
# 6    70008    5760.00  10-09-2012         3005         5001
# 7    70010    1983.43  10-10-2012         3001         5006
# 8    70003    2480.40  10-10-2012         3005         5003
# 9    70012     250.45  06-17-2012         3001         5002
# 10   70011      75.29  07-08-2012         3005         5007
# 11   70013    3045.60  04-25-2012         3005         5001


# 22. Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school. 
# Test Data:
#   school class            name date_Of_Birth   age  height   weight  address
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4


# 23. Write a Pandas program to split the following datasets into groups on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount. 
# Test Data:
#    ord_no  purch_amt    ord_date customer_id  salesman_id
# 0    70001     150.50  05-10-2012       C3001         5002
# 1    70009     270.65  09-10-2012       C3001         5005
# 2    70002      65.26  05-10-2012       D3005         5001
# 3    70004     110.50  08-17-2012       D3001         5003
# 4    70007     948.50  10-09-2012       C3005         5002
# 5    70005    2400.60  07-27-2012       D3001         5001
# 6    70008    5760.00  10-09-2012       C3005         5001
# 7    70010    1983.43  10-10-2012       D3001         5006
# 8    70003    2480.40  10-10-2012       D3005         5003
# 9    70012     250.45  06-17-2012       C3001         5002
# 10   70011      75.29  07-08-2012       D3005         5007
# 11   70013    3045.60  04-25-2012       D3005         5001


# 24. Write a Pandas program to split the following datasets into groups on customer_id to summarize purch_amt and calculate percentage of purch_amt in each group. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  05-10-2012         3001         5002
# 1    70009     270.65  09-10-2012         3001         5005
# 2    70002      65.26  05-10-2012         3005         5001
# 3    70004     110.50  08-17-2012         3001         5003
# 4    70007     948.50  10-09-2012         3005         5002
# 5    70005    2400.60  07-27-2012         3001         5001
# 6    70008    5760.00  10-09-2012         3005         5001
# 7    70010    1983.43  10-10-2012         3001         5006
# 8    70003    2480.40  10-10-2012         3005         5003
# 9    70012     250.45  06-17-2012         3001         5002
# 10   70011      75.29  07-08-2012         3005         5007
# 11   70013    3045.60  04-25-2012         3005         5001


# 25. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group, also change the column name of the aggregated metric. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id). 
# Test Data:
#   school class            name date_Of_Birth   age  height   weight  address
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4


# 26. Write a Pandas program to split a given dataset, group by two columns and convert other columns of the dataframe into a dictionary with column header as key. 
# Test Data:
#   school class            name date_Of_Birth   age  height   weight  address
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4


# 27. Write a Pandas program to split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate function to the rest of the columns of the dataframe. 
# Test Data:
#    salesman_id  sale_jan  sale_feb  sale_mar  sale_apr  sale_may  sale_jun  \
# 0          5002    150.50    250.50    150.50    150.50    130.50    150.50   
# 1          5005    270.65    170.65    270.65    270.65    270.65    270.65   
# 2          5001     65.26     15.26     65.26     95.26     65.26     45.26   
# 3          5003    110.50    110.50    110.50    210.50    310.50    110.50   
# 4          5002    948.50    598.50    948.50    948.50    948.50    948.50   
# 5          5001   2400.60   1400.60   2400.60   2400.60   2400.60   3400.60   
# 6          5001   1760.00   2760.00   5760.00    760.00    760.00   5760.00   
# 7          5006   2983.43   1983.43   1983.43   1983.43   1983.43    983.43   
# 8          5003    480.40   2480.40   2480.40   2480.40   2480.40   2480.40   
# 9          5002   1250.45    250.45    250.45    250.45    250.45    250.45   
# 10         5007     75.29     75.29     75.29     75.29     75.29     75.29   
# 11         5001   1045.60   3045.60   3045.60   3045.60   3045.60   3045.60   

#    sale_jul  sale_aug  sale_sep  sale_oct  sale_nov  sale_dec  
# 0     950.50    150.50    150.50    150.50    150.50    150.50  
# 1     270.65     70.65    270.65    270.65    270.65     70.65  
# 2      65.26     65.26     65.26     65.26     95.26     65.26  
# 3     210.50    110.50    110.50    110.50    110.50    110.50  
# 4     948.50    948.50    948.50    948.50    948.50    948.50  
# 5    2400.60    400.60    200.60   2400.60   2400.60   2400.60  
# 6    5760.00   5760.00   5760.00   5760.00   5760.00   5760.00  
# 7     983.43   1983.43   1983.43   1983.43   1983.43   1983.43  
# 8    2480.40   2480.40   2480.40   2480.40   2480.40   2480.40  
# 9     250.45    250.45    250.45    250.45    250.45    250.45  
# 10     75.29     75.29     75.29     75.29     75.29     75.29  
# 11   3045.60   3045.60   3045.60   3045.60   3045.60   3045.60  


# 28. Write a Pandas program to split a given dataset, group by one column and remove those groups if all the values of a specific columns are not available. 
# Test Data:
#   school class            name date_Of_Birth   age  height   weight  address
# S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
# S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
# S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
# S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
# S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
# S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4


# 29. Write a Pandas program to split a given dataset using group by on specified column into two labels and ranges. 
# Split the group on 'salesman_id',
# Ranges:
# 1) (5001...5006)
# 2) (5007..5012)
# Test Data:
#    salesman_id  sale_jan
# 0          5001    150.50
# 1          5002    270.65
# 2          5003     65.26
# 3          5004    110.50
# 4          5005    948.50
# 5          5006   2400.60
# 6          5007   1760.00
# 7          5008   2983.43
# 8          5009    480.40
# 9          5010   1250.45
# 10         5011     75.29
# 11         5012   1045.60



# 30. Write a Pandas program to split the following dataset using group by on first column and aggregate over multiple lists on second column. 
# Test Data:
#  student_id         marks
# 0       S001  [88, 89, 90]
# 1       S001  [78, 81, 60]
# 2       S002  [84, 83, 91]
# 3       S002  [84, 88, 91]
# 4       S003  [90, 89, 92]
# 5       S003  [88, 59, 90]

# Output:
# student_id
# S001 [83.0, 85.0, 75.0]
# S002 [84.0, 85.5, 91.0]
# S003 [89.0, 74.0, 91.0]

# 31. Write a Pandas program to split the following dataset using group by on 'salesman_id' and find the first order date for each group. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3005         5002
# 1    70009     270.65  2012-09-10         3001         5005
# 2    70002      65.26  2012-10-05         3002         5001
# 3    70004     110.50  2012-08-17         3009         5003
# 4    70007     948.50  2012-09-10         3005         5002
# 5    70005    2400.60  2012-07-27         3007         5001
# 6    70008    5760.00  2012-09-10         3002         5001
# 7    70010    1983.43  2012-10-10         3004         5004
# 8    70003    2480.40  2012-10-10         3009         5003
# 9    70012     250.45  2012-06-27         3008         5002
# 10   70011      75.29  2012-08-17         3003         5004
# 11   70013    3045.60  2012-04-25         3002         5001


# 32. Write a Pandas program to split a given dataset using group by on multiple columns and drop last n rows of from each group. 
# Test Data:
#    ord_no  purch_amt    ord_date  customer_id  salesman_id
# 0    70001     150.50  2012-10-05         3002         5002
# 1    70009     270.65  2012-09-10         3001         5003
# 2    70002      65.26  2012-10-05         3001         5001
# 3    70004     110.50  2012-08-17         3003         5003
# 4    70007     948.50  2012-09-10         3002         5002
# 5    70005    2400.60  2012-07-27         3002         5001
# 6    70008    5760.00  2012-09-10         3001         5001
# 7    70010    1983.43  2012-10-10         3004         5003
# 8    70003    2480.40  2012-10-10         3003         5003
# 9    70012     250.45  2012-06-27         3002         5002
# 10   70011      75.29  2012-08-17         3003         5003
# 11   70013    3045.60  2012-04-25         3001         5001

In [9]:
#14. using aggfunc with df.pivot_table
df=pd.read_excel('CDAC_DataBook.xlsx',sheet_name='ERPData')
df.head()

  MaterialID Location  Quantity
0    TMI-43T    MWH-4        34
1    AXCP-78    MWH-1        67
2    LXCV-21    MWH-2        27
3    AXCP-78    MWH-5        65
4    AXCP-78    MWH-4        36

In [12]:
df2=df.pivot_table('Quantity','MaterialID','Location').reset_index()  #bydefault the values are average values
df2

Location MaterialID       MWH-1  MWH-2  MWH-3      MWH-4       MWH-5
0           AXCP-78  109.600000   85.0   29.0  36.000000   66.666667
1           DDBN-89   43.333333   69.0   38.0  37.500000   71.000000
2           GCVB-79         NaN   39.0    NaN        NaN   26.000000
3           LXCV-21         NaN   27.0   42.0        NaN   58.000000
4           SDRT-67   45.500000   31.0    NaN  58.000000   57.000000
5           TMI-43T  120.000000   29.0   65.0  50.818182  112.000000

In [14]:
df2=df.pivot_table('Quantity','MaterialID','Location',aggfunc='size').reset_index()  #bydefault the values are average values
df2

Location MaterialID  MWH-1  MWH-2  MWH-3  MWH-4  MWH-5
0           AXCP-78    5.0    1.0    1.0    1.0    3.0
1           DDBN-89    3.0    1.0    1.0    2.0    1.0
2           GCVB-79    NaN    4.0    NaN    NaN    1.0
3           LXCV-21    NaN    1.0    1.0    NaN    3.0
4           SDRT-67    2.0    1.0    NaN    1.0    2.0
5           TMI-43T    1.0    1.0    1.0   11.0    1.0

In [13]:
df2=df.pivot_table('Quantity','MaterialID','Location',aggfunc='sum').reset_index()  #bydefault the values are average values
df2

Location MaterialID  MWH-1  MWH-2  MWH-3  MWH-4  MWH-5
0           AXCP-78  548.0   85.0   29.0   36.0  200.0
1           DDBN-89  130.0   69.0   38.0   75.0   71.0
2           GCVB-79    NaN  156.0    NaN    NaN   26.0
3           LXCV-21    NaN   27.0   42.0    NaN  174.0
4           SDRT-67   91.0   31.0    NaN   58.0  114.0
5           TMI-43T  120.0   29.0   65.0  559.0  112.0

In [573]:
np.random.randint(1,71,3)

array([36,  8, 22], dtype=int32)

In [5]:
sp=pd.read_excel('Sports.xlsx')
sp

   Country   Sports  Counts
0   India   Cricket      45
1     USA   Cricket      34
2       UK  Cricket      42
3    Japan  Cricket      36
4   India    Soccer      54
5     USA    Soccer      36
6       UK   Soccer      57
7    Japan   Soccer      25
8   India    Hockey      47
9     USA    Hockey      32
10      UK   Hockey      31
11   Japan   Hockey      23

In [6]:
sp.pivot_table('Counts','Sports','Country').reset_index()

Country   Sports  India   Japan    UK  USA
0        Cricket    45.0   36.0  42.0  34.0
1         Hockey    47.0   23.0  31.0  32.0
2         Soccer    54.0   25.0  57.0  36.0

In [7]:
sp.pivot_table('Counts','Country','Sports').reset_index()

Sports Country  Cricket  Hockey  Soccer
0       India      45.0    47.0    54.0
1        Japan     36.0    23.0    25.0
2           UK     42.0    31.0    57.0
3         USA      34.0    32.0    36.0